// miniprogram/pages/shouye/jieshao/jieshao.js
Page({

  /**
   * 页面的初始数据
   */
  data: {


 posts:[
    {
     title: '功能概述',
     neirong1:'  作业help小程序实现了学生和教师两类群体在作业上的信息交互，学生可直观明确当下的任务，教师可以系统了解各次作业的完成情况和学生反馈',
     title2: '当你想创建课程时',  
     neirong2: '教师创建课程时，填写课程资料卡，包括课程教师，名称，教材信息等，同时可进行备注的解释说明',
     titlet: '当你想布置作业时',
     neirong3: '创建课程后，可点击课程进入课程操作界面，包括发布作业、历史作业和作业反馈，另外下拉可跳转到课程的二维码，用于分享课程。发布作业时需要编辑作业名称、作业截止时间、数量及对应题号等信息，也可以图片形式发布',



     title3: '当你想加入课程时',
     neirong4:'学生加入课程操作为首页-加入课程-“+”，扫描课程二维码加入课程，',
      neirong6:'您可以在课程首页扫码加入如下课程体验学生作业相关功能',
     title4: '当你想查看作业时',

     neirong5: '学生加入课程后，可以转移到tarbar2(作业)上通过直观地方式进行查看作业和反馈.“作业”的初始界面上，显示用户作为学生角色的作业任务的统计图表，横轴为任务时间，纵轴为当日作业数量，且统计表可左右滑动查看任意日期的作业情况。',
    }
     ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})